Repository: leka/ios-monorepo
Catalog: Modules/RobotKit/Resources/Localizable.xcstrings
Source language: en
Languages: fr

# robotkit.bluetooth_unauthorized_view.button
source: Go to Settings
fr: Aller aux Réglages

# robotkit.connected_robot_view.navigation_title
source: Connected Device
fr: Appareil Connecté

# robotkit.connected_robot_view.rename_alert_button_label
source: Rename & Restart
fr: Renommer & Redémarrer

# robotkit.connected_robot_view.rename_alert_cancel_button_label
source: Cancel
fr: Annuler

# robotkit.connected_robot_view.rename_alert_message
source: Renaming requires a quick device restart to apply changes.
fr: Le changement de nom nécessite un redémarrage rapide de l'appareil pour appliquer les modifications.

# robotkit.connected_robot_view.rename_alert_text_field_placeholder
source: New device name
fr: Nouveau nom de l’appareil

# robotkit.connected_robot_view.rename_alert_title
source: Rename Device
fr: Renommer l'appareil

# robotkit.connected_robot_view.rename_button
source: Rename
fr: Renommer

# robotkit.connected_robot_view.robot_not_up_to_date_alert
source: An update for Leka is available
fr: Une mise à jour pour Leka est disponible

# robotkit.robot_connect_view.close_button
source: Close
fr: Fermer

# robotkit.robot_connect_view.connect_button
source: Connect
fr: Se connecter

# robotkit.robot_connect_view.continue_button
source: Continue
fr: Continuer

# robotkit.robot_connect_view.disconnect_button
source: Disconnect
fr: Se déconnecter

# robotkit.robot_connect_view.navigation_title
source: Connect to a robot
fr: Connecter un robot

# robotkit.robot_connect_view.searching_view_text
source: Searching for robots...
fr: Recherche en cours...

# robotkit.robot_connect_view.update_button
source: Update
fr: Mettre à jour

# robotkit.robot_connection_view.bluetooth_off_view.instruction
source: Go to Settings -> Select Bluetooth in sidebar -> Turn Bluetooth on.
fr: Aller dans Réglages -> Cliquez sur Bluetooth -> Activez le Bluetooth

# robotkit.robot_connection_view.bluetooth_off_view.message
source: You need Bluetooth to connect to a robot.
fr: Le Bluetooth est requis pour se connecter à un robot.

# robotkit.robot_connection_view.bluetooth_off_view.title
source: Bluetooth off
fr: Bluetooth désactivé

# robotkit.robot_connection_view.bluetooth_unauthorized_view.message
source: You need Bluetooth to connect to a robot. Please allow Leka App to use Bluetooth in your device settings
fr: Le Bluetooth est requis pour se connecter à un robot. Veuillez autoriser l'utilisation du Bluetooth pour cette application.

# robotkit.robot_connection_view.bluetooth_unauthorized_view.title
source: Bluetooth unauthorized
fr: Bluetooth non autorisé

# robotkit.robot_connection_view.restart_deep_sleep_robot_text
source: Leka is restarting from deep sleep state...
fr: Leka redémarre depuis l'état de veille profonde...

# robotkit.robot_discovery_view.close_alert_action
source: Close
fr: Fermer

# robotkit.robot_discovery_view.open_leka_updater_alert_action
source: Open LekaUpdater
fr: Ouvrir LekaUpdater

# robotkit.robot_discovery_view.robot_not_up_to_date_alert
source: An update for Leka is available
fr: Une mise à jour pour Leka est disponible
